<%--
  Created by IntelliJ IDEA.
  User: KIP-PC99
  Date: 04.07.2019
  Time: 10:43
  To change this template use File | Settings | File Templates.
--%>
<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<%@ taglib prefix="c" uri="http://java.sun.com/jsp/jstl/core" %>
<ul style="color: red; font-family: sans-serif; font-size: 24px">
    <%--<li >--%>
        <%--Внимание!!! В связи с произвольным сбросом временной зоны на ОС сервера, график в период с 24.06.2019 по 03.07.2019 отображается со сдвигом 3и часа по времени, просьба учитывать этот нюанс.--%>
    <%--</li>--%>
    <%--<li>--%>
        <%--С 04.07.2019 проблемма устранена.--%>
    <%--</li>--%>
<%--    <li>--%>
<%--        10.07.2019 улучшена ось Х (временная) время разбивается со скважностью 1н час.--%>
<%--    </li>--%>
<%--        <li>--%>
<%--            21.04.2020 изменен дизайн--%>
<%--        </li>--%>
<%--        <li>--%>
<%--            21.04.2020 добавлена аутентификация пользователя (логин, пароль)--%>
<%--        </li>--%>
<%--        <li>--%>
<%--            21.04.2020 добавлен Тред (орисовка графика в реальном времени)--%>
<%--        </li>--%>
<%--        <li>--%>
<%--            21.04.2020 для админов, добавлена фукция создания пользователей--%>
<%--        </li>--%>
<%--        <li>--%>
<%--            21.04.2020 для админов, добавлено логирование пользователей--%>
<%--        </li>--%>
<%--        <li>--%>
<%--            21.04.2020 для админов, добавлено вычитывание памяти базы данных--%>
<%--        </li>--%>
<%--        <li>--%>
<%--            21.04.2020 для технологов 2й цех, добавлена ​​возможность ввода параметров с компьютера, на линии диэлектрики--%>
<%--        </li>--%>
<%--        <li>--%>
<%--            20.05.2020 для технологов 2й цех, добавлены рецепты на камеры вулканизации 1, 2--%>
<%--        </li>--%>
<%--        <li>--%>
<%--            15.06.2020 сбой сервера отсутствуют данные с 13.00 до 16.00--%>
<%--        </li>--%>
<%--        <li>--%>
<%--            15.06.2020 исправлена ​​генерация данных в заголовке отчета--%>
<%--        </li>--%>
        <li>
            03.02.2021 додано архівацію: лінія напальчників
        </li>
        <li>
            04.02.2021 додано архівацію: сенсор повітря 1
        </li>
        <li>
            15.02.2021 додано архівацію: камера вулканізації, силіконова зона
        </li>
</ul>